======================
Pointer type commands
======================

*entry0
*entry0=cc
*entry0+10=cc

---

(commands
  (arged_command (cmd_identifier)
    (eq_sep_key))
  (arged_command (cmd_identifier)
    (eq_sep_key)
    (eq_sep_val))
  (arged_command (cmd_identifier)
    (eq_sep_key)
    (eq_sep_val)))


==============================
Environment variable command
==============================

%
%SHELL
%TMPDIR=/tmp

---

(commands
  (arged_command (cmd_identifier))
  (arged_command (cmd_identifier)
    (eq_sep_key))
  (arged_command (cmd_identifier)
    (eq_sep_key)
    (eq_sep_val)))


===============
Macro commands
===============

(foo x y, p8 $0 @ $1)
(-foo)
(foo x y, p8 $0 @ $1)(10 0x10)
(
(*

---

(commands
  (arged_command (cmd_identifier)
    (macro_content))
  (arged_command (cmd_identifier)
    (macro_content))
  (arged_command (cmd_identifier)
    (macro_content)
    (macro_call_content))
  (arged_command (cmd_identifier))
  (arged_command (cmd_identifier)))


===============
System commands
===============

!
!ls
!!
!!ls
!=!

---

(commands
  (arged_command (system_identifier))
  (arged_command (system_identifier)
    (system_arg))
  (arged_command (system_identifier))
  (arged_command (system_identifier)
    (system_arg))
  (arged_command (system_identifier)))


===================
Interpret r2 commands
===================

.cmd a1
.. myfile
. myfile.r2
.* file
.!rabin2 -ri $FILE
.(foo 1 2 3)
./ ELF

---

(commands
  (arged_command
    command: (cmd_identifier)
    args: (arged_command command: (cmd_identifier)
            args: (arg (arg_identifier))))
  (arged_command
    command: (cmd_identifier)
    args: (arg (arg_identifier)))
  (arged_command
    command: (cmd_identifier)
    args: (arg (arg_identifier)))
  (arged_command
    command: (cmd_identifier)
    args: (arg (arg_identifier)))
  (arged_command
    command: (cmd_identifier)
    args: (interpret_arg))
  (arged_command
    command: (cmd_identifier)
    args: (macro_content))
  (arged_command
    command: (cmd_identifier)
    args: (arg (arg_identifier)))
  )


============
Last cmd
============

.
...

---

(commands
  (arged_command (cmd_identifier))
  (arged_command (cmd_identifier)))

===================
Interpreter commands
===================

#!
#!python arg0
#!rust

---

(commands
  (interpreter_command)
  (interpreter_command)
  (interpreter_command))
